pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_convert_relatives.h
//---------------------------------------------------------------------------*
//                                                                           *
//                     File 'pic18_convert_relatives.h'                      *
//                        Generated by version 2.4.5                         *
//                      june 18th, 2013, at 14h54'11"                        *
//                                                                           *
//---------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

#ifndef pic18_convert_relatives_ENTITIES_DEFINED
#define pic18_convert_relatives_ENTITIES_DEFINED

//---------------------------------------------------------------------------*

#include "galgas2/predefined-types.h"

//---------------------------------------------------------------------------*

#include "pic18_intermediate_classes_set_current_address.h"
#include "pic18_intermediate_classes_instruction_length.h"
#include "pic18_intermediate_classes.h"
#include "pic18_mnemonics.h"
#include "pic18_metamodel.h"
#include "generic_metamodel.h"
#include "intermediate_generic.h"
#include "piccoloDevice_semantics.h"

//---------------------------------------------------------------------------*

class GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives ;
class GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element ;

//---------------------------------------------------------------------------*
//                                                                           *
//         @pic18_intermediate_symbolTableForConvertingRelatives map         *
//                                                                           *
//---------------------------------------------------------------------------*

class cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives ;

//---------------------------------------------------------------------------*

extern const char * kSearchErrorMessage_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_searchKey ;

//---------------------------------------------------------------------------*

class GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives : public AC_GALGAS_map {
//--------------------------------- Default constructor
  public : GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives (void) ;

//--------------------------------- Handle copy
  public : GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives (const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives & inSource) ;
  public : GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives & operator = (const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives & inSource) ;

//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives extractObject (const GALGAS_object & inObject,
                                                                                                         C_Compiler * inCompiler,
                                                                                                         const GALGAS_location & inErrorLocation
                                                                                                         COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives constructor_emptyMap (LOCATION_ARGS) ;

  public : static GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives constructor_mapWithMapToOverride (const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives & inOperand0
                                                                                                                            COMMA_LOCATION_ARGS) ;


//--------------------------------- Modifiers
  public : VIRTUAL_IN_DEBUG void modifier_insertKey (GALGAS_lstring constinArgument0,
                                                     GALGAS_uint constinArgument1,
                                                     C_Compiler * inCompiler
                                                     COMMA_LOCATION_ARGS) ;

  public : VIRTUAL_IN_DEBUG void modifier_setMRoutineAddressForKey (GALGAS_uint constinArgument0,
                                                                    GALGAS_string constinArgument1,
                                                                    C_Compiler * inCompiler
                                                                    COMMA_LOCATION_ARGS) ;


//--------------------------------- Instance Methods
  public : VIRTUAL_IN_DEBUG void method_searchKey (GALGAS_lstring constinArgument0,
                                                   GALGAS_uint & outArgument1,
                                                   C_Compiler * inCompiler
                                                   COMMA_LOCATION_ARGS) const ;

//--------------------------------- Class Methods

//--------------------------------- Readers
  public : VIRTUAL_IN_DEBUG GALGAS_uint reader_mRoutineAddressForKey (const GALGAS_string & constinOperand0,
                                                                      C_Compiler * inCompiler
                                                                      COMMA_LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives reader_overriddenMap (LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
//--------------------------------- 'with' accessors
  public : VIRTUAL_IN_DEBUG cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives * readWriteAccessForWithInstruction_hasKey (C_Compiler * inCompiler,
                                                                                                                                                     const GALGAS_string & inKey
                                                                                                                                                     COMMA_LOCATION_ARGS) ;

  public : VIRTUAL_IN_DEBUG cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives * readWriteAccessForWithInstruction_searchKey (C_Compiler * inCompiler,
                                                                                                                                                        const GALGAS_lstring & inKey
                                                                                                                                                        COMMA_LOCATION_ARGS) ;

//--------------------------------- Friend

  friend class cEnumerator_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives ;
 
} ; // End of GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives class

//---------------------------------------------------------------------------*
//   Enumerator declaration                                                  *
//---------------------------------------------------------------------------*

class cEnumerator_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives : public cGenericAbstractEnumerator {
  public : cEnumerator_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives (const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives & inEnumeratedObject,
                                                                                         const typeEnumerationOrder inOrder) ;

//--- Current element access
  public : GALGAS_lstring current_lkey (LOCATION_ARGS) const ;
  public : GALGAS_uint current_mRoutineAddress (LOCATION_ARGS) const ;
//--- Current element access
  public : GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element current (LOCATION_ARGS) const ;
} ;

//---------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives ;

//--------------------------------- 'with' accessors
cCollectionElement * readWriteAccessForWithInstruction_hasKey (C_Compiler * inCompiler,
                                                               GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives & ioMap,
                                                               GALGAS_string & inKey
                                                               COMMA_LOCATION_ARGS) ;

cCollectionElement * readWriteAccessForWithInstruction_searchKey (C_Compiler * inCompiler,
                                                                  GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives & ioMap,
                                                                  GALGAS_lstring & inKey
                                                                  COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Routine 'pic18_intermediate_convertRelativeBranchsToAbsoluteWhenNeeded'  *
//                                                                           *
//---------------------------------------------------------------------------*

void routine_pic_31__38__5F_intermediate_5F_convertRelativeBranchsToAbsoluteWhenNeeded (GALGAS_pic_31__38__5F_intermediate_5F_instructionList & ioArgument0,
                                                                                        GALGAS_string & ioArgument1,
                                                                                        C_Compiler * inCompiler
                                                                                        COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Category method '@pic18_intermediate_instruction defineLabelAtAddress'   *
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_defineLabelAtAddress) (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                         GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives & ioArgument0,
                                                                                                         GALGAS_uint & ioArgument1,
                                                                                                         C_Compiler * inCompiler
                                                                                                         COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_defineLabelAtAddress (const PMSInt32 inClassIndex,
                                               categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_defineLabelAtAddress inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_defineLabelAtAddress (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                              GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives & io_ioRoutineSymbolTable,
                                              GALGAS_uint & io_ioAddress,
                                              C_Compiler * inCompiler
                                              COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Abstract category method '@pic18_intermediate_instruction checkRelativeBranch'*
//                                                                           *
//---------------------------------------------------------------------------*

typedef void (*categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_checkRelativeBranch) (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                        const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives constinArgument0,
                                                                                                        GALGAS_uint & ioArgument1,
                                                                                                        GALGAS_bool & ioArgument2,
                                                                                                        GALGAS_pic_31__38__5F_intermediate_5F_instructionList & ioArgument3,
                                                                                                        const GALGAS_uint constinArgument4,
                                                                                                        GALGAS_string & ioArgument5,
                                                                                                        C_Compiler * inCompiler
                                                                                                        COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*

void enterCategoryMethod_checkRelativeBranch (const PMSInt32 inClassIndex,
                                              categoryMethodSignature_pic_31__38__5F_intermediate_5F_instruction_checkRelativeBranch inMethod) ;

//---------------------------------------------------------------------------*

void callCategoryMethod_checkRelativeBranch (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                             const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives constin_inRoutineSymbolTable,
                                             GALGAS_uint & io_ioAddress,
                                             GALGAS_bool & io_ioRelativeBranchOverflow,
                                             GALGAS_pic_31__38__5F_intermediate_5F_instructionList & io_ioGeneratedInstructionList,
                                             const GALGAS_uint constin_inIndex,
                                             GALGAS_string & io_ioListFileContents,
                                             C_Compiler * inCompiler
                                             COMMA_LOCATION_ARGS) ;

//---------------------------------------------------------------------------*
//                                                                           *
//@pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element struct*
//                                                                           *
//---------------------------------------------------------------------------*

class GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element : public AC_GALGAS_root {
//--------------------------------- Public data members
  public : GALGAS_lstring mAttribute_lkey ;
  public : GALGAS_uint mAttribute_mRoutineAddress ;


//--------------------------------- Accessors
  public : VIRTUAL_IN_DEBUG bool isValid (void) const ;
  public : VIRTUAL_IN_DEBUG void drop (void) ;

//--------------------------------- Default constructor
  public : GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element (void) ;

//--------------------------------- Virtual destructor (in debug mode)
  public : VIRTUAL_IN_DEBUG ~ GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element (void) ;

//--------------------------------- Native constructor
  public : GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element (const GALGAS_lstring & in_lkey,
                                                                                               const GALGAS_uint & in_mRoutineAddress) ;

//-- Start of generic part --*

//--------------------------------- Object cloning
  protected : virtual AC_GALGAS_root * clonedObject (void) const ;

//--------------------------------- Object extraction
  public : static GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element extractObject (const GALGAS_object & inObject,
                                                                                                                    C_Compiler * inCompiler,
                                                                                                                    const GALGAS_location & inErrorLocation
                                                                                                                    COMMA_LOCATION_ARGS) ;

//--------------------------------- GALGAS constructors
  public : static GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element constructor_new (const GALGAS_lstring & inOperand0,
                                                                                                                      const GALGAS_uint & inOperand1
                                                                                                                      COMMA_LOCATION_ARGS) ;

//--------------------------------- Implementation of reader 'description'
  public : VIRTUAL_IN_DEBUG void description (C_String & ioString,
                                              const PMSInt32 inIndentation) const ;
//--------------------------------- Comparison
  public : typeComparisonResult objectCompare (const GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element & inOperand) const ;

//--------------------------------- Modifiers

//--------------------------------- Instance Methods
//--------------------------------- Class Methods

//--------------------------------- Readers
  public : VIRTUAL_IN_DEBUG GALGAS_lstring reader_lkey (LOCATION_ARGS) const ;

  public : VIRTUAL_IN_DEBUG GALGAS_uint reader_mRoutineAddress (LOCATION_ARGS) const ;


//--------------------------------- Introspection
  public : VIRTUAL_IN_DEBUG const C_galgas_type_descriptor * staticTypeDescriptor (void) const ;
 
} ; // End of GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element class


//---------------------------------------------------------------------------*

extern const C_galgas_type_descriptor kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives_2E_element ;

//---------------------------------------------------------------------------*
//                                                                           *
//Class for element of '@pic18_intermediate_symbolTableForConvertingRelatives' map*
//                                                                           *
//---------------------------------------------------------------------------*

class cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives : public cMapElement {
//--- Map attributes
  public : GALGAS_uint mAttribute_mRoutineAddress ;

//--- Constructor
  public : cMapElement_pic_31__38__5F_intermediate_5F_symbolTableForConvertingRelatives (const GALGAS_lstring & inKey,
                                                                                         const GALGAS_uint & in_mRoutineAddress
                                                                                         COMMA_LOCATION_ARGS) ;

//--- Virtual method for comparing elements
  public : virtual typeComparisonResult compare (const cCollectionElement * inOperand) const ;

//--- Virtual method that checks that all attributes are valid
  public : virtual bool isValid (void) const ;

//--- Virtual method that returns a copy of current object
  public : virtual cMapElement * copy (void) ;

//--- Description
 public : virtual void description (C_String & ioString, const PMSInt32 inIndentation) const ;
} ;

//--- START OF USER ZONE 2


//--- END OF USER ZONE 2

#endif
